Update README for final AWS deployment
